tap "bufbuild/buf"
tap "derailed/k9s"
tap "go-task/tap"
tap "homebrew/bundle"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for exploring each layer in a docker image
brew "dive"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Statically typed language for the Erlang VM
brew "gleam"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line hex viewer
brew "hexyl"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3", link: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Command-line client for WebSockets
brew "websocat"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
