tap "bufbuild/buf"
tap "derailed/k9s"
tap "go-task/tap"
tap "homebrew/bundle"
# GNU compiler collection
brew "gcc"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3", link: true
# Cross-shell prompt for astronauts
brew "starship"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
vscode "Command is only available in WSL or inside a Visual Studio Code terminal."
